# PrintManager Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..PrintManager Property
Document Class See Also
---
Retrieve the PrintManager of current project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PrintManager PrintManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PrintManager As PrintManager
	Get
```

Visual C++
---
```text
public:
property PrintManager^ PrintManager {
	PrintManager^ get ();
}
```

# See Also
Document Class
Autodesk.Revit.DB Namespace